Repository: yejincheng420/Magpie
Catalog: src/Magpie/Resources.language-*.resw
Source language: en_us
Languages: zh_hans, zh_hant

# Message_TouchSupport
source: The touch support component could not start. Disable touch support and retry, or run Magpie as administrator and enable it again.
zh_hans: 触控支持组件启动失败。请暂时关闭触控支持后重试；如需使用触控，请以管理员身份重新启用。
zh_hant: 啟用觸控支援失敗。

# Message_InvalidSourceWindow
source: The effect group cannot be enabled for this window. Make sure it is running, responsive, on a display, and at least 64×64 pixels.
zh_hans: 无法为这个窗口启用效果组。请确认它仍在运行、未停止响应、位于显示器内且窗口尺寸不小于 64×64。
zh_hant: 無法為這個視窗啟用效果組。請確認它仍在執行、沒有停止回應、位於顯示器內且視窗尺寸不小於 64×64。

# Message_Maximized
source: Effect groups are disabled for maximized or fullscreen windows. Restore the window, or enable “Allow effect groups for maximized or fullscreen windows” under Home → Advanced.
zh_hans: 当前禁止为最大化或全屏窗口启用效果组。请先还原窗口，或在“主页 → 高级”中启用“允许为最大化或全屏窗口启用效果组”。
zh_hant: 目前禁止為最大化或全螢幕視窗啟用效果組。請先還原視窗，或在「首頁 → 進階」中啟用「允許為最大化或全螢幕視窗啟用效果組」。

# Message_LowIntegrityLevel
source: The target window has higher privileges than Magpie. Close Magpie and run it as administrator, then try again.
zh_hans: 目标窗口的权限高于 Magpie。请关闭 Magpie，并以管理员身份重新运行后重试。
zh_hant: Magpie 需要以管理員身分執行才能為這個視窗啟用效果組。

# Message_ScalingFailedGeneral
source: The effect group could not initialize. Disable it, reopen the target window and retry. If it still fails, restart Magpie.
zh_hans: 效果组初始化失败。请停用效果组、重新打开目标窗口并重试；如果仍然失败，请重新启动 Magpie。
zh_hant: 效果組初始化失敗。請停用效果組、重新開啟目標視窗並重試；若仍然失敗，請重新啟動 Magpie。

# Message_CaptureFailed
source: Restore the source window and enable the effect group again. If capture still fails, open View details to check the capture step and error code.
zh_hans: 无法捕获这个窗口。请确认窗口没有最小化，并在当前配置中将捕获方式改为“默认”或 Graphics Capture 后重试。
zh_hant: 無法擷取這個視窗，請嘗試切換擷取方式。

# Message_CreateFenceFailed
source: The selected graphics card could not create synchronization resources. Open the profile below, go to Performance → Graphics card and select another available card. If it still fails, update its driver and provide details and logs.
zh_hans: 所选显卡或驱动不支持效果处理所需的同步功能。请在当前配置的“性能”中切换显卡，或更新显卡驱动后重试。
zh_hant: 所選顯示卡或驅動程式不支援效果處理所需的同步功能。請在目前設定的「效能」中切換顯示卡，或更新驅動程式後重試。

# Message_NvidiaVsrPathUnsupported
source: NVIDIA VSR did not start (error -2). Exit Magpie, extract the complete package to a folder such as C:\Magpie\, then run Magpie.exe from that folder and retry. Path compatibility is a possible cause. If it still fails, copy the details and include the logs.
zh_hans: NVIDIA VSR 初始化失败（错误 -2）。请将 Magpie 完整解压到仅含英文字母和数字的路径，所有上级目录都不要包含中文或特殊字符，例如 C:\Magpie\，然后重新运行。
zh_hant: NVIDIA VSR 初始化失敗（錯誤 -2）。請將 Magpie 完整解壓縮到僅含英文字母和數字的路徑，所有上層目錄都不要包含中文或特殊字元，例如 C:\Magpie\，然後重新執行。

# Message_ScalingFailed
source: Could not enable effect group
zh_hans: 无法启用效果组
zh_hant: 無法啟用效果組

# Message_ScalingStarted
source: Scaling started. Press the scaling shortcut again to stop.
zh_hans: 缩放已开始，再次按下缩放快捷键停止
zh_hant: 縮放已開始，再按一次縮放捷徑停止

# Profile_Performance_NoGraphicsCard.Title
source: No compatible graphics card was found, so slower CPU rendering will be used. Make sure your graphics driver is installed and up to date.
zh_hans: 找不到兼容的显卡，将使用性能较低的 CPU 渲染。请确认显卡驱动已经正确安装并更新。
zh_hant: 未找到相容的顯示卡，因此將改用 CPU 渲染，很可能達不到理想效能。

# Home_Advanced_MinFrameRate.Header
source: Minimum frame rate
zh_hans: 最小帧率
zh_hant: 最小幀率

# Home_Advanced_MinFrameRate.Description
source: Stabilizes GPU frequency to reduce stuttering, but may lead to higher power consumption
zh_hans: 稳定 GPU 频率以减少卡顿，但会导致功耗增加
zh_hant: 穩定 GPU 頻率以減少卡頓，但會導致電力消耗增加

# Home_Advanced_DeveloperOptions_DisableFP16.Content
source: Disable the use of FP16 in shaders
zh_hans: 禁止在着色器中使用 FP16
zh_hant: 禁止在著色器中使用 FP16

# Home_Advanced_DeveloperOptions_BenchmarkMode.Content
source: Benchmark mode
zh_hans: 性能测试模式
zh_hant: 性能測試模式

# Root_NewProfileFlyout_NameContextFlyout_AppName
source: Fill with application name
zh_hans: 填入应用名
zh_hant: 輸入應用程式的名稱

# Root_NewProfileFlyout_NameContextFlyout_ProcessName
source: Fill with process name
zh_hans: 填入进程名
zh_hant: 輸入處理程序名稱

# Root_NewProfileFlyout_NameContextFlyout_WindowTitle
source: Fill with window title
zh_hans: 填入窗口标题
zh_hant: 輸入視窗標題

# TextMenuFlyout_Copy
source: Copy
zh_hans: 复制
zh_hant: 複製

# TextMenuFlyout_Cut
source: Cut
zh_hans: 剪切
zh_hant: 剪下

# TextMenuFlyout_Paste
source: Paste
zh_hans: 粘贴
zh_hant: 貼上

# TextMenuFlyout_Redo
source: Redo
zh_hans: 重新操作
zh_hant: 重新操作

# TextMenuFlyout_SelectAll
source: Select All
zh_hans: 全选
zh_hant: 全選

# TextMenuFlyout_Undo
source: Undo
zh_hans: 取消操作
zh_hant: 取消操作

# Message_BannedInWindowedMode
source: The source application is maximized or fullscreen. Switch it to windowed mode and restore its window to a size smaller than the screen, then start windowed effects again.
zh_hans: 当前窗口已最大化或处于全屏状态。请先还原窗口或退出全屏，也可以改用全屏模式。
zh_hant: 不支援視窗模式這個視窗。

# Message_InvalidCropping
source: The cropped area is too small or invalid. Reduce the crop values so both dimensions are at least 64 pixels, or disable custom cropping.
zh_hans: 裁剪后的区域过小或无效。请减小裁剪值，确保宽高至少为 64 像素，或关闭自定义裁剪。
zh_hant: 無法套用自訂裁剪。

# Home_Activation.Description
source: Press the shortcut to enable the effect group for the foreground window, or disable the active effect group.
zh_hans: 按下快捷键可为前台窗口启用效果组，或停用当前正在运行的效果组。
zh_hant: 按下快速鍵可為前景視窗啟用效果組，或停用目前正在執行的效果組。

# Home_Activation_FullscreenScaling.Header
source: Effect group shortcut (fullscreen mode)
zh_hans: 效果组快捷键（全屏模式）
zh_hant: 效果組快速鍵（全螢幕模式）

# Home_TouchSupport.Description
source: Due to system security restrictions, Magpie requires UIAccess privilege to support touch input.
zh_hans: 由于操作系统的安全限制，Magpie 需要 UIAccess 权限来支持触控输入。
zh_hant: 由於作業系統的安全限制，Magpie 需要 UIAccess 權限來支援觸控輸入。

# Home_Activation_FullscreenScaling_ShortcutControl.Title
source: Effect group shortcut (fullscreen mode)
zh_hans: 效果组快捷键（全屏模式）
zh_hant: 效果組快速鍵（全螢幕模式）

# Home_Activation_WindowedScaling.Header
source: Effect group shortcut (windowed mode)
zh_hans: 效果组快捷键（窗口模式）
zh_hant: 效果組快速鍵（視窗模式）

# Home_Activation_WindowedScaling_ShortcutControl.Title
source: Effect group shortcut (windowed mode)
zh_hans: 效果组快捷键（窗口模式）
zh_hant: 效果組快速鍵（視窗模式）

# Home_Advanced_AllowScalingMaximized.Description
source: Applies only to fullscreen mode
zh_hans: 仅适用于全屏模式
zh_hant: 僅適用於全螢幕模式

# Home_Toolbar.Description
source: The toolbar is at the top of the output window and provides FPS display and screenshots. In windowed mode, drag the toolbar to move the output window.
zh_hans: 工具栏位于输出窗口顶部，提供帧率显示、截图等功能；窗口模式下还可拖动工具栏移动输出窗口。
zh_hant: 工具列位於輸出視窗頂部，提供幀率顯示、截圖等功能；視窗模式下還可拖曳工具列移動輸出視窗。

# Home_Toolbar.Header
source: Toolbar
zh_hans: 工具栏
zh_hant: 工具列

# Home_Toolbar_InitialState.Header
source: Initial toolbar state
zh_hans: 工具栏初始状态
zh_hant: 工具列初始狀態

# Home_Toolbar_InitialState_AlwaysShow.Content
source: Always show
zh_hans: 始终显示
zh_hant: 始終顯示

# Home_Toolbar_InitialState_AutoHide.Content
source: Auto-hide
zh_hans: 自动隐藏
zh_hant: 自動隱藏

# Home_Toolbar_InitialState_Off.Content
source: Off
zh_hans: 关闭
zh_hant: 關閉

# Home_Toolbar_StateToggle.Header
source: Toolbar state toggle shortcut
zh_hans: 工具栏状态切换快捷键
zh_hant: 工具列狀態切換快速鍵

# Home_Toolbar_StateToggle_ShortcutControl.Title
source: Toolbar state toggle shortcut
zh_hans: 工具栏状态切换快捷键
zh_hant: 工具列狀態切換快速鍵

# Message_ToolbarIn3DGameMode
source: The toolbar is unavailable in 3D game mode. Disable the effect group and disable 3D game mode, or use effect group shortcuts.
zh_hans: 3D 游戏模式不支持工具栏。请停用效果组并关闭 3D 游戏模式，或使用效果组快捷键进行控制。
zh_hant: 3D 遊戲模式下不支援工具列。

# Message_ToolbarNewState
source: Toolbar: {}
zh_hans: 工具栏：{}
zh_hant: 工具列：{}

# Overlay_Toolbar_Close
source: Disable effect group
zh_hans: 停用效果组
zh_hant: 停用效果組

# Overlay_Toolbar_Demo
source: ImGui Demo Window
zh_hans: ImGui 演示窗口
zh_hant: ImGui 示範視窗

# Overlay_Toolbar_Pin
source: Pin Toolbar
zh_hans: 固定工具栏
zh_hant: 固定工具列

# Overlay_Toolbar_TakeScreenshot
source: Take Screenshot
zh_hans: 截图
zh_hant: 截圖

# Overlay_Toolbar_Profiler
source: Profiler Window
zh_hans: 性能分析器窗口
zh_hant: 效能分析器視窗

# Message_Windowed3DGameMode
source: For windowed mode, open the profile below and turn off 3D game mode. To keep this setting, use the fullscreen shortcut shown on Home.
zh_hans: 当前配置启用了 3D 游戏模式，无法使用窗口模式。请关闭 3D 游戏模式，或改用全屏模式。
zh_hant: 3D 遊戲模式下不支援視窗模式。

# Profile_General_3DGameMode.Description
source: Enables optimizations for 3D games, but is incompatible with the toolbar and windowed mode
zh_hans: 针对 3D 游戏优化，不支持工具栏和窗口模式
zh_hant: 針對 3D 遊戲最佳化，不支援工具列和視窗模式

# Home_Toolbar_ScreenshotSaveDirectory.Header
source: Screenshot save directory
zh_hans: 截图保存目录
zh_hant: 截圖儲存目錄

# Home_Toolbar_ScreenshotSaveDirectory_Change.Content
source: Change
zh_hans: 更改
zh_hant: 更改

# Dialog_SetlectScreenshotSaveDirectory_Title
source: Select a directory to save screenshots
zh_hans: 选择截图保存目录
zh_hant: 選擇截圖儲存目錄

# Message_ScreenshotSaved
source: Screenshot saved as {}
zh_hans: 已保存截图 {}
zh_hant: 已儲存截圖 {}

# Message_ScreenshotFailed
source: The screenshot could not be saved. Check that the screenshot folder exists and is writable, or choose another folder on the Home page.
zh_hans: 无法保存截图。请检查截图保存目录是否存在且可写，或在主页中更换保存位置后重试。
zh_hant: 截圖失敗。

# Overlay_Toolbar_TakeScreenshot_Description
source: Save the selected original or processed image; right-click to export intermediate processing results
zh_hans: 保存当前选中的原图或效果图；右键可导出效果处理中间结果
zh_hant: 儲存目前選取的原圖或效果圖；按右鍵可匯出效果處理中間結果

# Overlay_Toolbar_TakeScreenshot_PopupTitle
source: Export intermediate result
zh_hans: 导出中间结果
zh_hant: 匯出中間結果

# Profile_WindowedScaling.Header
source: Windowed mode
zh_hans: 窗口模式
zh_hant: 視窗模式

# Profile_WindowedScaling_InitialScaleFactor.Header
source: Initial scale factor
zh_hans: 初始缩放倍数
zh_hant: 初始縮放倍數

# Profile_WindowedScaling_InitialScaleFactor_Auto.Content
source: Auto
zh_hans: 自动
zh_hant: 自動

# Profile_WindowedScaling_InitialScaleFactor_Custom.Content
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# Profile_Advanced_DisableDirectFlip.Description
source: Helps avoid certain compatibility issues but may significantly increase latency
zh_hans: 可避免部分兼容性问题，但可能显著增加延迟
zh_hant: 可避免部份相容性問題，但可能顯著增加延遲

# Profile_General_AutoScale_Disabled.Content
source: Disabled
zh_hans: 禁用
zh_hant: 停用

# Profile_General_AutoScale_Fullscreen.Content
source: Fullscreen mode
zh_hans: 全屏模式
zh_hant: 全螢幕模式

# Profile_General_AutoScale_Windowed.Content
source: Windowed mode
zh_hans: 窗口模式
zh_hant: 視窗模式

# Profile_General_Multimonitor.Description
source: Applies to fullscreen mode only
zh_hans: 仅适用于全屏模式
zh_hant: 僅適用於全螢幕模式

# Home_TouchSupport_Warn.Title
source: The toolbar does not support touch input. Use a mouse or keyboard shortcuts instead.
zh_hans: 工具栏不支持触控输入，请使用鼠标或快捷键操作。
zh_hant: 工具列不支援觸控輸入。

# Overlay_Toolbar_Close_Description
source: Right-click to close toolbar
zh_hans: 右键以关闭工具栏
zh_hant: 右鍵以關閉工具列

# Overlay_Toolbar_SwitchToFullscreen
source: Switch to Fullscreen Mode
zh_hans: 切换到全屏模式
zh_hant: 切換到全螢幕模式

# Overlay_Toolbar_SwitchToWindowed
source: Switch to Windowed Mode
zh_hans: 切换到窗口模式
zh_hant: 切換到視窗模式

# Home_Toolbar_InitialState_Fullscreen.Header
source: Fullscreen mode
zh_hans: 全屏模式
zh_hant: 全螢幕模式

# Home_Toolbar_InitialState_Windowed.Header
source: Windowed mode
zh_hans: 窗口模式
zh_hant: 視窗模式

# Message_ExportScalingModesFailed
source: Effect groups could not be exported. Choose a writable location and check that the file is not in use and sufficient disk space is available.
zh_hans: 导出效果组失败。请选择可写入的位置，并检查文件是否被占用以及磁盘空间是否充足。
zh_hant: 匯出效果組失敗。

# Message_ImportScalingModesFailed
source: Effect groups could not be imported. Select a readable effect-group JSON file and make sure its contents are not corrupted.
zh_hans: 导入效果组失败。请选择有效且可读取的效果组 JSON 文件，并确认文件内容没有损坏。
zh_hant: 匯入效果組失敗。

# Home_Advanced_DeveloperOptions_LocateLogs.Header
source: Open logs location
zh_hans: 打开日志位置
zh_hant: 打開日誌位置

# Message_WindowedDesktopDuplication
source: For windowed mode, open the profile below and select Graphics Capture as the capture method. To keep Desktop Duplication, use the fullscreen shortcut shown on Home.
zh_hans: Desktop Duplication 不支持窗口模式。请将捕获方式改为“默认”或 Graphics Capture，或改用全屏模式。
zh_hant: Desktop Duplication 擷取不支援視窗模式。

# Profile_General_DesktopDuplicationWarning.Title
source: For windowed mode, select Graphics Capture above. Use fullscreen mode to keep Desktop Duplication.
zh_hans: Desktop Duplication 不支持窗口模式。请改用“默认”或 Graphics Capture，或使用全屏模式。
zh_hant: 此擷取方式和視窗模式不相容。

# Settings_Launch_RunAtStartup.Description
source: The main window will not appear if "Display the app on the system tray" is enabled
zh_hans: 启用了“在系统托盘上显示应用程序”时将不会显示主窗口
zh_hant: 啟用了「在系統匣上顯示應用程式」時將不會顯示主視窗

# Home_Activation_Timer_Description
source: Enable the effect group for the foreground window after {}s
zh_hans: {} 秒后为前台窗口启用效果组
zh_hant: {} 秒後為前景視窗啟用效果組

# Home_Activation_Timer_Start
source: Start
zh_hans: 开始
zh_hant: 開始

# NotifyIcon_Timer_Fullscreen
source: Enable effect group after {}s (Fullscreen)
zh_hans: {} 秒后启用效果组（全屏模式）
zh_hant: {} 秒後啟用效果組（全螢幕模式）

# NotifyIcon_Timer_Windowed
source: Enable effect group after {}s (Windowed)
zh_hans: {} 秒后启用效果组（窗口模式）
zh_hant: {} 秒後啟用效果組（視窗模式）

# Overlay_Toolbar_Minimize
source: Minimize
zh_hans: 最小化
zh_hant: 最小化

# Profile_Cursor_AutoHide.Header
source: Auto-hide cursor when idle
zh_hans: 光标静止时自动隐藏
zh_hant: 游標靜止時自動隱藏

# Profile_Cursor_AutoHide_Delay.Header
source: Hide delay in seconds
zh_hans: 隐藏延迟（秒）
zh_hant: 隱藏倒數（秒）

# Profile_Advanced_DestAlignment.Description
source: Applies only to fullscreen mode
zh_hans: 仅适用于全屏模式
zh_hant: 僅適用於全螢幕模式

# Profile_Advanced_DestAlignment.Header
source: Output alignment
zh_hans: 输出画面位置
zh_hant: 輸出畫面位置

# Profile_Advanced_DestAlignment_BottomCenter.Content
source: Bottom center
zh_hans: 底部居中
zh_hant: 底部置中

# Profile_Advanced_DestAlignment_BottomLeft.Content
source: Bottom left
zh_hans: 左下角
zh_hant: 左下角

# Profile_Advanced_DestAlignment_BottomRight.Content
source: Bottom right
zh_hans: 右下角
zh_hant: 右下角

# Profile_Advanced_DestAlignment_Center.Content
source: Center
zh_hans: 居中
zh_hant: 置中對齊

# Profile_Advanced_DestAlignment_Left.Content
source: Left
zh_hans: 左对齐
zh_hant: 向左對齊

# Profile_Advanced_DestAlignment_Right.Content
source: Right
zh_hans: 右对齐
zh_hant: 向右對齊

# Profile_Advanced_DestAlignment_TopCenter.Content
source: Top center
zh_hans: 顶部居中
zh_hant: 頂部置中

# Profile_Advanced_DestAlignment_TopLeft.Content
source: Top left
zh_hans: 左上角
zh_hant: 左上角

# Profile_Advanced_DestAlignment_TopRight.Content
source: Top right
zh_hans: 右上角
zh_hant: 右上角

# Home_Advanced_DeveloperOptions_DisableTopmost.Content
source: Disable always-on-top
zh_hans: 禁用输出窗口置顶
zh_hant: 停用輸出視窗置頂

# Settings_General_SmoothMotionCompatibilityMode.Header
source: Smooth Motion compatibility mode
zh_hans: Smooth Motion 兼容模式

# Settings_General_SmoothMotionCompatibilityMode.Description
source: Restart Magpie after each effect session to release GPU memory retained by NVIDIA Smooth Motion. Enable only when Smooth Motion is configured for Magpie.
zh_hans: 每次停用效果组后重启 Magpie，释放 NVIDIA Smooth Motion 驱动驻留的显存。仅在已为 Magpie 启用 Smooth Motion 时开启。

# Overlay_Toolbar_EffectParameters
source: Effect parameters
zh_hans: 效果参数
zh_hant: 效果參數

# Overlay_EffectParameters
source: Effect parameters
zh_hans: 效果参数
zh_hant: 效果參數

# Overlay_EffectParameters_Live
source: Live
zh_hans: 实时
zh_hant: 即時

# Overlay_EffectParameters_RestartRequired
source: Restart
zh_hans: 重启
zh_hant: 重啟

# Overlay_EffectParameters_LiveApplied
source: Live changes applied
zh_hans: 实时更改已应用
zh_hant: 即時變更已套用

# Overlay_EffectParameters_RestartPending
source: {} parameter(s) waiting for the effect group to restart
zh_hans: 有 {} 项等待重新启用效果组
zh_hant: 有 {} 項等待重新啟用效果組

# Overlay_EffectParameters_RequestPending
source: Saving automatically…
zh_hans: 正在自动保存…
zh_hant: 正在自動儲存…

# Overlay_EffectParameters_Revert
source: Restore session values
zh_hans: 恢复本次运行初始值
zh_hant: 還原本次執行初始值

# Overlay_EffectParameters_ApplyAndRestart
source: Apply and restart effect group
zh_hans: 应用并重新启用效果组
zh_hant: 套用並重新啟用效果組

# Overlay_EffectParameters_NoParameters
source: The current effect chain has no exposed parameters.
zh_hans: 当前效果链没有暴露参数。
zh_hant: 目前效果鏈沒有公開參數。

# Overlay_EffectParameters_Saved
source: Effect parameters saved.
zh_hans: 效果参数已保存。
zh_hant: 效果參數已儲存。

# Overlay_EffectParameters_LiveApplyFailed
source: The image still uses the last working value. Restore that value, or click Apply and restart effect group to try the new value.
zh_hans: 实时参数应用失败，画面继续使用上一次成功的值。
zh_hant: 即時參數套用失敗，畫面繼續使用上一次成功的值。

# Overlay_EffectParameters_SessionExpired
source: The active run changed and this request was not saved. Reopen the effect parameters panel, check the latest values, then adjust them.
zh_hans: 运行会话已变化，参数未保存。
zh_hant: 執行工作階段已變更，參數未儲存。

# Overlay_EffectParameters_SourceUnavailable
source: The source window is unavailable and re-enabling did not complete. Open the source program, bring it to the foreground, then enable the group and check the parameters.
zh_hans: 源窗口已不可用。
zh_hant: 來源視窗已無法使用。

# Overlay_EffectParameters_ScalingModeConflict
source: The group or parameters changed elsewhere. This panel’s changes were not saved. Disable and re-enable the group to load the latest settings before adjusting again.
zh_hans: 运行期间效果组结构已变化，未覆盖任何配置。
zh_hant: 執行期間效果組結構已變更，未覆寫任何設定。

# Overlay_EffectParameters_SaveFailed
source: Parameters are not saved. Open Home → Most recent issue → View details, resolve the cause, then click Retry save.
zh_hans: 自动保存失败，修改参数可重试。
zh_hant: 自動儲存失敗，修改參數可重試。

# Overlay_EffectParameters_Invalid
source: This parameter cannot be adjusted yet. Re-enable the group and reopen the panel. If it remains unavailable, restore this effect from the complete package and provide its name and logs.
zh_hans: 此参数的元数据或运行时绑定无效，当前无法调节。
zh_hant: 此參數的中繼資料或執行階段繫結無效，目前無法調整。

# Overlay_EffectParameters_Reason_Inline
source: This parameter is compiled into the shader.
zh_hans: 此参数已编译进着色器。
zh_hant: 此參數已編譯進著色器。

# Overlay_EffectParameters_Reason_Native
source: This native effect only reads the parameter during startup.
zh_hans: 此原生效果只在启动时读取该参数。
zh_hant: 此原生效果只在啟動時讀取該參數。

# Overlay_EffectParameters_Reason_Resources
source: This parameter changes effect resources or processing size.
zh_hans: 此参数会改变效果资源或处理尺寸。
zh_hant: 此參數會改變效果資源或處理尺寸。

# Overlay_EffectParameters_Reason_Guidance
source: This parameter changes the frame-guidance provider.
zh_hans: 此参数会改变帧引导提供器。
zh_hant: 此參數會改變影格引導提供器。

# Overlay_EffectParameters_Reason_FrameGeneration
source: This parameter changes the frame-generation feature or presentation ring.
zh_hans: 此参数会改变帧生成 Feature 或呈现环。
zh_hant: 此參數會改變影格生成 Feature 或呈現環。

# Message_OpticalFlowProviderUnavailable
source: Open the effects listed in details and select another optical flow method offered by the effect, or disable optical flow, then enable the group again. This build does not provide the requested method.
zh_hans: 当前版本未提供所选光流提供者。请选择其他光流方法或“无”。
zh_hant: 目前版本未提供所選光流提供者。請選擇其他光流方法或「無」。

# Message_NvidiaOpticalFlowUnsupported
source: NVIDIA optical flow did not start. Check the affected effects in details, open that group and choose the option that disables optical flow, then enable the group again. If you need optical flow, try AMD optical flow when offered by the effect.
zh_hans: 当前 GPU 或驱动无法初始化 NVIDIA 光流。请选择 AMD OF 或“无”。
zh_hant: 目前 GPU 或驅動程式無法初始化 NVIDIA 光流。請選擇 AMD OF 或「無」。

# Message_NvidiaOpticalFlowQualityUnsupported
source: Open the effects listed in details and lower their NVIDIA optical flow quality, then enable the group again. You can also disable optical flow first. The selected quality did not pass the GPU or driver capability check.
zh_hans: 所选 NVIDIA 光流质量需要当前 GPU 或驱动不支持的输出网格。请选择较低质量、AMD OF 或“无”。
zh_hant: 所選 NVIDIA 光流品質需要目前 GPU 或驅動程式不支援的輸出網格。請選擇較低品質、AMD OF 或「無」。

# Message_AmdOpticalFlowUnsupported
source: AMD optical flow did not start. Open the effects listed in details, disable optical flow and enable the group again. If you need optical flow, try another method offered by the effect. See details and logs for the capability check results.
zh_hans: 当前 GPU 不满足 AMD FidelityFX 光流所需的 D3D12、着色器模型、Wave 运算或格式能力。请选择界面中其他可用的光流方法，或选择“无”。
zh_hant: 目前 GPU 不符合 AMD FidelityFX 光流所需的 D3D12、著色器模型、Wave 運算或格式能力。請選擇介面中其他可用的光流方法，或選擇「無」。

# Message_OpticalFlowInteropFailed
source: Optical flow shared resources could not be created. Open the effects listed in details, disable optical flow and enable the group again. If you need optical flow, try another method offered by the effect.
zh_hans: 所选光流方法无法创建 D3D11/D3D12 共享资源。请选择其他光流方法或“无”。
zh_hant: 所選光流方法無法建立 D3D11/D3D12 共用資源。請選擇其他光流方法或「無」。

# Message_ConflictingFrameGenerationEffects
source: The effect group below contains multiple frame generation effects. Check the conflicting entries in details, open this group and keep the one you want to use. Remove the other frame generation entries, then enable the group again.
zh_hans: 同一效果组只能包含一个帧生成效果器。请移除 DLSSFG、XeSSFG x2 或 XeSS 多帧生成中的冲突项后重试。
zh_hant: 同一效果組只能包含一個畫格生成效果器。請移除 DLSSFG、XeSSFG x2 或 XeSS 多畫格生成中的衝突項目後重試。

# Message_XeSSMfgRequiresIntel
source: XeSS Multi-Frame Generation x3/x4 requires a supported Intel Arc GPU. Use XeSS Frame Generation x2 on this GPU.
zh_hans: XeSS 多帧生成 x3/x4 需要受支持的 Intel Arc 显卡。请在当前显卡上改用 XeSS 帧生成 x2。
zh_hant: XeSS 多畫格生成 x3/x4 需要受支援的 Intel Arc 顯示卡。請在目前顯示卡上改用 XeSS 畫格生成 x2。

# Message_XeSSMfgUnsupported
source: The selected Intel GPU or driver cannot initialize XeSS Multi-Frame Generation. Update the driver or use XeSS Frame Generation x2.
zh_hans: 当前 Intel 显卡或驱动无法初始化 XeSS 多帧生成。请更新驱动，或改用 XeSS 帧生成 x2。
zh_hant: 目前 Intel 顯示卡或驅動程式無法初始化 XeSS 多畫格生成。請更新驅動程式，或改用 XeSS 畫格生成 x2。

# Message_XeSSMfgMultiplierUnsupported
source: The selected XeSS Multi-Frame Generation multiplier is not supported by this GPU or driver. Select a lower MFG multiplier, or use XeSS Frame Generation x2.
zh_hans: 当前显卡或驱动不支持所选 XeSS 多帧生成倍率。请选择较低的 MFG 倍率，或改用 XeSS 帧生成 x2。
zh_hant: 目前顯示卡或驅動程式不支援所選 XeSS 多畫格生成倍率。請選擇較低的 MFG 倍率，或改用 XeSS 畫格生成 x2。

# Home_Toolbar_Profiler.Header
source: Performance monitor
zh_hans: 性能监测
zh_hant: 效能監測

# Home_Toolbar_Profiler_ShortcutControl.Title
source: Performance monitor
zh_hans: 性能监测
zh_hant: 效能監測

# Home_Toolbar_EffectParameters.Header
source: Open / close parameter panel
zh_hans: 效果参数
zh_hant: 效果參數

# Home_Toolbar_EffectParameters_ShortcutControl.Title
source: Open / close parameter panel
zh_hans: 效果参数
zh_hant: 效果參數

# Home_Toolbar_Screenshot.Header
source: Take screenshot
zh_hans: 截屏
zh_hant: 擷取螢幕畫面

# Home_Toolbar_Screenshot_ShortcutControl.Title
source: Take screenshot
zh_hans: 截屏
zh_hant: 擷取螢幕畫面

# Home_Toolbar_ToolbarPin.Header
source: Pin toolbar
zh_hans: 固定工具栏
zh_hant: 釘選工具列

# Home_Toolbar_ToolbarPin_ShortcutControl.Title
source: Pin toolbar
zh_hans: 固定工具栏
zh_hant: 釘選工具列

# Overlay_EffectParameters_AutoSaved
source: Changes saved automatically
zh_hans: 修改已自动保存
zh_hant: 修改已自動儲存

# Home_Toolbar_Shortcuts.Header
source: Toolbar shortcut settings
zh_hans: 工具栏快捷键设置
zh_hant: 工具列快速鍵設定

# EffectParam_Anime4K_Anime4K_Denoise_Bilateral_Mean_intensitySigma_Label
source: Strength
zh_hans: 强度
zh_hant: 強度

# EffectParam_Anime4K_Anime4K_Denoise_Bilateral_Median_intensitySigma_Label
source: Strength
zh_hans: 强度
zh_hant: 強度

# EffectParam_Anime4K_Anime4K_Denoise_Bilateral_Mode_intensitySigma_Label
source: Strength
zh_hans: 强度
zh_hant: 強度

# EffectParam_Anime4K_Anime4K_Thin_HQ_iterations_Label
source: Iterations
zh_hans: 迭代次数
zh_hant: 迭代次數

# EffectParam_Anime4K_Anime4K_Thin_HQ_strength_Label
source: Strength
zh_hans: 强度
zh_hant: 強度

# EffectParam_Bicubic_paramB_Label
source: B
zh_hans: B 参数
zh_hant: B 參數

# EffectParam_Bicubic_paramC_Label
source: C
zh_hans: C 参数
zh_hant: C 參數

# EffectParam_CAS_CAS_Scaling_sharpness_Label
source: Sharpness
zh_hans: 锐度
zh_hant: 銳利度

# EffectParam_CAS_CAS_sharpness_Label
source: Sharpness
zh_hans: 锐度
zh_hant: 銳利度

# EffectParam_CRT_CRT_Easymode_brightBoost_Label
source: Brightness Boost
zh_hans: 亮度增强
zh_hant: 亮度增強

# EffectParam_CRT_CRT_Easymode_dilation_Label
source: Dilation
zh_hans: 膨胀量
zh_hant: 膨脹量

# EffectParam_CRT_CRT_Easymode_gammaInput_Label
source: Gamma Input
zh_hans: 输入伽马
zh_hant: 輸入伽瑪

# EffectParam_CRT_CRT_Easymode_gammaOutput_Label
source: Gamma Output
zh_hans: 输出伽马
zh_hant: 輸出伽瑪
